#! /usr/bin/perl -w

%students = (
    "01" => "Студент 1",
    "02" => "Студент 2",
    "03" => "Студент 3",
    "04" => "Студент 4",
    "05" => "Студент 5",
    "06" => "Студент 6",
    "07" => "Студент 7",
    "08" => "Студент 8",
    "09" => "Студент 9",
    "10" => "Студент 10"
);

%examGrades = (
    "01" => 8,
    "02" => 7,
    "03" => 5,
    "04" => 9,
    "05" => 8,
    "06" => 6,
    "07" => 4,
    "08" => 10,
    "09" => 7,
    "10" => 9
);

%graduateWorkGrades = (
    "01" => 9,
    "02" => 8,
    "03" => 6,
    "04" => 8,
    "05" => 9,
    "06" => 7,
    "07" => 5,
    "08" => 9,
    "09" => 8,
    "10" => 10
);

$person = "01";
print "Студент - $students{$person} получил следующие оценки:\n";
print "за экзамен - $examGrades{$person}\n";
print "за выпускную работу - $graduateWorkGrades{$person}\n";